
# Утилиты генерации Record ID и хеширования

Этот модуль предоставляет служебные функции для генерации уникальных числовых идентификаторов записей (Record ID) на основе структурированных идентификационных номеров и для безопасного хеширования данных с использованием алгоритма SHA-512 и фиксированной соли. Реализации доступны как для Python, так и для Oracle (PL/SQL), что обеспечивает кроссплатформенность и согласованность логики.

---

## Основные особенности

- **Генерация кастомного Record ID** Преобразует входную строку ID, содержащую информацию о поле, дате рождения и числовом суффиксе, в компактную, обфусцированную числовую строку. Уникальность гарантируется вычислением количества дней с базовой даты (1940-01-01) и использованием дополнительных смещений.

- **Безопасное хеширование по стандарту SHA-512** Все данные перед хешированием дополнительно конкатенируются с фиксированной солью, что существенно повышает безопасность.

- **Единая логика для Python и Oracle** Функции соответствуют друг другу по логике и особенностям обработки данных, позволяя использовать модуль в различных инфраструктурах без потери совместимости.

---

## Требования

- **Python** Используются только стандартные библиотеки: `datetime`, `hashlib`, `typing`. Внешних зависимостей нет.

- **Oracle** Требуется Oracle Database с поддержкой встроенной функции `STANDARD_HASH` и пакета `UTL_I18N`.

---

## Документация по функциям

### Python

#### 1. `func_generate_record_id`

```python
def func_generate_record_id(inn: str, shift: int = 0, verbose: bool = False) -> Optional[str]:
```

**Описание:** Генерирует уникальный Record ID на основе структурированной входной строки `inn`.

**Последовательность действий:**
1. Проверяет формат входных данных (пол, дата, суффикс).
2. Вычисляет количество дней с 1940-01-01 до даты рождения.
3. Применяет указанное смещение `shift` к суффиксу.
4. Формирует конечный числовой ID.

**Формат входной строки `inn`:**

| Индекс | Описание |
| :--- | :--- |
| **0** | Индикатор пола — `1` для женщин, `2` для мужчин |
| **1-8** | Дата рождения в формате `ДДММГГГГ` |
| **9+** | Числовой суффикс (одна и более цифр) |

**Параметры:**
- `inn` (str): Структурированная строка ID.
- `shift` (int, опционально): Смещение суффикса (по умолчанию `0`).
- `verbose` (bool, опционально): Включение логирования ошибок.

**Возвращает:** `str` — сгенерированный Record ID или `None` при неправильных данных.

---

#### 2. `func_generate_sha`

```python
def func_generate_sha(input_data: str, bit_length: int = 512, salt: str = "") -> Optional[str]:
```

**Описание:** Выполняет SHA-512 хеширование входной строки с обязательной конкатенацией соли.

**Параметры:**
- `input_data` (str): Данные для хеширования.
- `bit_length` (int, опционально): Длина хеша, строго `512` бит.
- `salt` (str, опционально): Соль, обязательно (Информация будет передана отдельно).

**Возвращает:** Шестнадцатеричный дайджест (hex) или `None`, если вход пуст.

---

### Oracle PL/SQL

#### 1. `func_dsp_dsml_generate_record_id`

```sql
FUNCTION func_dsp_dsml_generate_record_id(
    p_inn IN VARCHAR2,
    p_shift IN NUMBER DEFAULT 0
) RETURN VARCHAR2;
```

**Описание:** PL/SQL версия генерации Record ID по логике, идентичной Python-версии (включая поддержку сдвига и базовой даты).

**Параметры:**
- `p_inn` (VARCHAR2): Входная структурированная строка ID.
- `p_shift` (NUMBER, опционально): Смещение суффикса.

**Возвращает:** Сгенерированный Record ID или `NULL` при ошибках.

---

#### 2. `func_dsml_dsp_sha_algorithm`

```sql
FUNCTION func_dsml_dsp_sha_algorithm(
    p_data IN VARCHAR2,
    p_salt IN VARCHAR2 DEFAULT '',
    p_algorithm IN VARCHAR2 DEFAULT 'SHA512'
) RETURN VARCHAR2;
```

**Описание:** Хеширует входные данные, используя Oracle функцию `STANDARD_HASH` с заданным алгоритмом (по умолчанию `SHA512`) и солью.

**Параметры:**
- `p_data` (VARCHAR2): Данные для хеширования.
- `p_salt` (VARCHAR2): Соль для конкатенации перед хешированием.
- `p_algorithm` (VARCHAR2): Алгоритм хеширования, по умолчанию `'SHA512'`.

**Возвращает:** Hex-строку хеша или `NULL`, если вход `NULL`.

---

## Примеры использования

### Python

```python
import func_generate_record_id, func_generate_sha
from dotenv import load_dotenv
load_dotenv()  # Load environment variables from .env file


SALT = os.getenv("SALT", "")

inn = "22110199500001"  # 2 - Мужчина | 21101995 - дата | 00001 - суффикс

# Генерация Record ID
record_id = func_generate_record_id(inn, verbose=True)
print(f"Generated Record ID: {record_id}")
# Вывод: 4076401266

# Хеширование Record ID
hashed_rec_id = func_generate_sha(record_id, bit_length=512, salt=SALT)
print(f"SHA-512 Hash: {hashed_rec_id}")
# Пример вывода:
# fc82bcf49c1630209a816c668240b4b363ace3bcc1f1f7675bcbe39ef07d1d87e6faf789c5155b424455863d1be9877c867db2a25465dadba3688420e7ab6bd3
```

### Oracle PL/SQL

```sql
DECLARE
  v_rec_id VARCHAR2(100);
  v_hashed_rec_id VARCHAR2(4000);
  v_salt VARCHAR2(100);
BEGIN
  -- Генерация Record ID
  v_rec_id := func_dsp_dsml_generate_record_id(
      p_inn => '22110199500001'
  );
  v_salt := ...

  -- Хеширование с солью
  v_hashed_rec_id := func_dsml_dsp_sha_algorithm(
      p_data => v_rec_id,
      p_salt => v_salt
  );

  -- Вывод результатов
  DBMS_OUTPUT.PUT_LINE('Record ID: ' || v_rec_id);
  DBMS_OUTPUT.PUT_LINE('Hashed ID: ' || v_hashed_rec_id);
END;
/
```

---

## Дополнительные замечания

- Входная дата рождения в ID должна быть **не ранее 1940-01-01**, иначе функции возвращают `None` / `NULL`.
- Пол кодируется строго числом `1` (женщина) или `2` (мужчина), другие значения считаются ошибочными.
- Хеширование **всегда** происходит с добавлением фиксированной соли (информация будет дана отдельно) перед данными для улучшения безопасности.
- Обе реализации — Python и Oracle — обеспечивают идентичное поведение, позволяя использовать их в различных компонентах архитектуры без расхождений.
```